import React from "react";
import Svg, { Path } from "react-native-svg";

export default function ExportIcon({ size = 29 }: { size?: number }) {
  return (
    <Svg
      width={size}
      height={(size * 35) / 29} // الحفاظ على النسبة الأصلية
      viewBox="0 0 29 35"
      fill="none"
    >
      {/* المستطيل الرملي */}
      <Path
        d="M22.7922 1H1V33.7966H22.7922V1Z"
        fill="#CCA884"
        stroke="black"
        strokeMiterlimit={10}
      />

      {/* السهم الأسود */}
      <Path
        d="M28.1585 17.752C28.3537 17.5567 28.3537 17.2401 28.1585 17.0449L24.9765 13.8629C24.7812 13.6676 24.4647 13.6676 24.2694 13.8629C24.0741 14.0582 24.0741 14.3747 24.2694 14.57L27.0978 17.3984L24.2694 20.2269C24.0741 20.4221 24.0741 20.7387 24.2694 20.934C24.4647 21.1292 24.7812 21.1292 24.9765 20.934L28.1585 17.752ZM17.896 16.8984C17.6199 16.8984 17.396 17.1223 17.396 17.3984C17.396 17.6746 17.6199 17.8984 17.896 17.8984V16.8984ZM27.8049 17.3984V16.8984H17.896V17.3984V17.8984H27.8049V17.3984Z"
        fill="black"
      />
    </Svg>
  );
}
